In [1]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

**1. Write a Pandas program to get the powers of an array values element-wise.**

In [11]:
arr = np.array([2,3,4])

sr = pd.Series(arr)
print("Original Series: ")
print(sr)
print()

power = sr.pow(sr)
print("Transformed Series:")
print(power)

Original Series:
0    2
1    3
2    4
dtype: int32

Transformed Series:
0      4
1     27
2    256
dtype: int32

**2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.**

In [12]:
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
data = {
    'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
    'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
    'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no'],
    'labels' : labels
}
df = pd.DataFrame.from_dict(data)
df.set_index('labels')

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

In [13]:
import pandas as pd

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
    'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
    'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

data['labels'] = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, columns=['birds', 'age', 'visits', 'priority', 'labels'])
df.set_index('labels')

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

In [15]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df1 = pd.DataFrame(exam_data, columns = ['name','score','attempts','qualify'])

df1['labels'] = labels

df1.set_index('labels')

             name  score  attempts qualify
labels
a       Anastasia   12.5         1     yes
b            Dima    9.0         3      no
c       Katherine   16.5         2     yes
d           James    NaN         3      no
e           Emily    9.0         2      no
f         Michael   20.0         3     yes
g         Matthew   14.5         1     yes
h           Laura    NaN         1      no
i           Kevin    8.0         2      no
j           Jonas   19.0         1     yes

In [169]:
import pandas as pd
import numpy as np

exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [17]:
df.describe()

           score   attempts
count   8.000000  10.000000
mean   13.562500   1.900000
std     4.693746   0.875595
min     8.000000   1.000000
25%     9.000000   1.000000
50%    13.500000   2.000000
75%    17.125000   2.750000
max    20.000000   3.000000

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [19]:
df.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

In [20]:
df['name']

a    Anastasia
b         Dima
c    Katherine
d        James
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object

In [21]:
df['score']

a    12.5
b     9.0
c    16.5
d     NaN
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64

In [26]:
df.sample(1)

    name  score  attempts qualify
e  Emily    9.0         2      no

In [30]:
print(df.iloc[[1,3,5,6],[1,3]])

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

In [32]:
df.iloc[[0]]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes

In [175]:
df['score'].mean()

13.5625

In [176]:
np.mean(df['score'])

13.5625

**Print specific rows from a dataframe**

In [34]:
df.iloc[[0,1,2]]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

**Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.**

In [39]:
print(df[df['attempts'] > 2])

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

**8. Write a Pandas program to count the number of rows and columns of a DataFrame.**

In [40]:
df.shape

(10, 4)

*OR*

In [42]:
total_rows=len(df.axes[0]) #No of rows, 0 is rows
total_cols=len(df.axes[1]) #No of columns, 1 is columns
print("Number of Rows: "+str(total_rows))
print("Number of Columns: "+str(total_cols))

Number of Rows: 10
Number of Columns: 4

**9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.**

In [44]:
df.isnull() #for entire datafram

    name  score  attempts  qualify
a  False  False     False    False
b  False  False     False    False
c  False  False     False    False
d  False   True     False    False
e  False  False     False    False
f  False  False     False    False
g  False  False     False    False
h  False   True     False    False
i  False  False     False    False
j  False  False     False    False

*OR*

In [50]:
print("Rows where score is missing:")
print()
print(df[df['score'].isnull()]) #to get values from a specific column

Rows where score is missing:

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

*OR*

In [48]:
df['score'].isnull()

a    False
b    False
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: score, dtype: bool

**10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).**

*.between()*

In [51]:
df['score'].between(15,20)

a    False
b    False
c     True
d    False
e    False
f     True
g    False
h    False
i    False
j     True
Name: score, dtype: bool

*OR a Better way*

In [52]:
print("Rows where score between 15 and 20 (inclusive):")
print(df[df['score'].between(15, 20)])

Rows where score between 15 and 20 (inclusive):
        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

**11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.**

In [63]:
print(df[(df['attempts'] < 2)])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
j      Jonas   19.0         1     yes

*Or the results together*

In [65]:
print("Number of attempts in the examination is less than 2 and score greater than 15 :")
print(df[(df['attempts'] < 2) & (df['score'] > 15)])

Number of attempts in the examination is less than 2 and score greater than 15 :
    name  score  attempts qualify
j  Jonas   19.0         1     yes

**12. Write a Pandas program to change the score in row 'd' to 11.5.**

In [71]:
df.loc['d', 'score'] = 11.5
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

**13. Write a Pandas program to calculate the sum of the examination attempts by the students.**

In [73]:
df['attempts'].sum()

19

**14. Write a Pandas program to calculate the mean score for each different student in DataFrame.**

In [75]:
df['score'].mean()

13.333333333333334

**15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.**

In [82]:
df.sample(1)

    name score attempts qualify
j  Jonas    19        1     yes

In [98]:
df.loc['k'] = ['Rohan','100','1','yes']

In [79]:
df.tail()

      name score attempts qualify
g  Matthew  14.5        1     yes
h    Laura   NaN        1      no
i    Kevin     8        2      no
j    Jonas    19        1     yes
k    Rohan   100        1     yes

**16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.**

In [91]:
df.sort_values(by=['name', 'score'], ascending=[True, True])

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima     9        3      no
e      Emily     9        2      no
d      James  11.5        3      no
j      Jonas    19        1     yes
c  Katherine  16.5        2     yes
i      Kevin     8        2      no
h      Laura   NaN        1      no
g    Matthew  14.5        1     yes
f    Michael    20        3     yes
k      Rohan   100        1     yes

In [88]:
df.sort_values(['name'])

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima     9        3      no
e      Emily     9        2      no
d      James  11.5        3      no
j      Jonas    19        1     yes
c  Katherine  16.5        2     yes
i      Kevin     8        2      no
h      Laura   NaN        1      no
g    Matthew  14.5        1     yes
f    Michael    20        3     yes
k      Rohan   100        1     yes

In [90]:
df.sort_values(by=['name', 'score'])

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima     9        3      no
e      Emily     9        2      no
d      James  11.5        3      no
j      Jonas    19        1     yes
c  Katherine  16.5        2     yes
i      Kevin     8        2      no
h      Laura   NaN        1      no
g    Matthew  14.5        1     yes
f    Michael    20        3     yes
k      Rohan   100        1     yes

**17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False**

In [96]:
df.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

In [136]:
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})

        Name     Sex Score Qualify
a  Anastasia  Female  12.5     NaN
b       Kyra  Female     9     NaN
c  Katherine  Female  16.5     NaN
d      James    Male   NaN     NaN
e      Emily  Female     9     NaN
f    Michael    Male    20     NaN
g    Matthew    Male  14.5     NaN
h      Laura  Female   NaN     NaN
i      Kevin    Male     8     NaN
j      Jonas    Male    19     NaN
k      Rohan    Male   100     NaN

**18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.**

In [103]:
df['name'] = df['name'].replace('Dima','Kyra')
df

        name score attempts qualify
a  Anastasia  12.5        1     NaN
b       Kyra     9        3     NaN
c  Katherine  16.5        2     NaN
d      James   NaN        3     NaN
e      Emily     9        2     NaN
f    Michael    20        3     NaN
g    Matthew  14.5        1     NaN
h      Laura   NaN        1     NaN
i      Kevin     8        2     NaN
j      Jonas    19        1     NaN
k      Rohan   100        1    True

**19. Write a Pandas program to delete the 'attempts' column from the DataFrame.**

*df.pop()*

In [107]:
df.pop('attempts')

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
k    1
Name: attempts, dtype: object

In [108]:
df

        name score qualify
a  Anastasia  12.5     NaN
b       Kyra     9     NaN
c  Katherine  16.5     NaN
d      James   NaN     NaN
e      Emily     9     NaN
f    Michael    20     NaN
g    Matthew  14.5     NaN
h      Laura   NaN     NaN
i      Kevin     8     NaN
j      Jonas    19     NaN
k      Rohan   100    True

**20. Write a Pandas program to insert a new column in existing DataFrame.**

In [110]:
sex = ['Female','Female','Female','Male','Female','Male','Male','Female','Male','Male','Male']

df['Sex'] = sex

In [111]:
df

        name score qualify     Sex
a  Anastasia  12.5     NaN  Female
b       Kyra     9     NaN  Female
c  Katherine  16.5     NaN  Female
d      James   NaN     NaN    Male
e      Emily     9     NaN  Female
f    Michael    20     NaN    Male
g    Matthew  14.5     NaN    Male
h      Laura   NaN     NaN  Female
i      Kevin     8     NaN    Male
j      Jonas    19     NaN    Male
k      Rohan   100    True    Male

**21. Write a Pandas program to iterate over rows in a DataFrame.**

*df.iterrows()*

In [119]:
for index, row in df.iterrows():
    print(row['name'], ":", row['Sex'])

Anastasia : Female
Kyra : Female
Katherine : Female
James : Male
Emily : Female
Michael : Male
Matthew : Male
Laura : Female
Kevin : Male
Jonas : Male
Rohan : Male

**22. Write a Pandas program to get list from DataFrame column headers.**

In [122]:
print(df.columns)

Index(['name', 'score', 'qualify', 'Sex'], dtype='object')

**23. Write a Pandas program to rename columns of a given DataFrame.**

In [126]:
df = df.rename(columns={"name": "Name"})
df

        Name score qualify     Sex
a  Anastasia  12.5     NaN  Female
b       Kyra     9     NaN  Female
c  Katherine  16.5     NaN  Female
d      James   NaN     NaN    Male
e      Emily     9     NaN  Female
f    Michael    20     NaN    Male
g    Matthew  14.5     NaN    Male
h      Laura   NaN     NaN  Female
i      Kevin     8     NaN    Male
j      Jonas    19     NaN    Male
k      Rohan   100    True    Male

In [127]:
df = df.rename(columns={'score':'Score'})
df

        Name Score qualify     Sex
a  Anastasia  12.5     NaN  Female
b       Kyra     9     NaN  Female
c  Katherine  16.5     NaN  Female
d      James   NaN     NaN    Male
e      Emily     9     NaN  Female
f    Michael    20     NaN    Male
g    Matthew  14.5     NaN    Male
h      Laura   NaN     NaN  Female
i      Kevin     8     NaN    Male
j      Jonas    19     NaN    Male
k      Rohan   100    True    Male

In [128]:
df = df.rename(columns={'qualify':'Qualify'})
df

        Name Score Qualify     Sex
a  Anastasia  12.5     NaN  Female
b       Kyra     9     NaN  Female
c  Katherine  16.5     NaN  Female
d      James   NaN     NaN    Male
e      Emily     9     NaN  Female
f    Michael    20     NaN    Male
g    Matthew  14.5     NaN    Male
h      Laura   NaN     NaN  Female
i      Kevin     8     NaN    Male
j      Jonas    19     NaN    Male
k      Rohan   100    True    Male

**24. Write a Pandas program to select rows from a given DataFrame based on values in some columns.**

In [131]:
print(df.loc[df['Sex'] == 'Female'])

        Name Score Qualify     Sex
a  Anastasia  12.5     NaN  Female
b       Kyra     9     NaN  Female
c  Katherine  16.5     NaN  Female
e      Emily     9     NaN  Female
h      Laura   NaN     NaN  Female

**25. Write a Pandas program to change the order of a DataFrame columns.**

In [133]:
df.sample()

    Name Score Qualify   Sex
d  James   NaN     NaN  Male

In [134]:
df = df[['Name','Sex','Score','Qualify']]
df

        Name     Sex Score Qualify
a  Anastasia  Female  12.5     NaN
b       Kyra  Female     9     NaN
c  Katherine  Female  16.5     NaN
d      James    Male   NaN     NaN
e      Emily  Female     9     NaN
f    Michael    Male    20     NaN
g    Matthew    Male  14.5     NaN
h      Laura  Female   NaN     NaN
i      Kevin    Male     8     NaN
j      Jonas    Male    19     NaN
k      Rohan    Male   100    True

**26. Write a Pandas program to add one row in an existing DataFrame.**

In [138]:
df.loc['l'] = ['Yash','99','1','True']

#or
#df2 = {'Name': 'Yash', 'Sex': 'Male', 'Score': '99', 'Qualify':'True'}

df

        Name     Sex Score Qualify
a  Anastasia  Female  12.5     NaN
b       Kyra  Female     9     NaN
c  Katherine  Female  16.5     NaN
d      James    Male   NaN     NaN
e      Emily  Female     9     NaN
f    Michael    Male    20     NaN
g    Matthew    Male  14.5     NaN
h      Laura  Female   NaN     NaN
i      Kevin    Male     8     NaN
j      Jonas    Male    19     NaN
k      Rohan    Male   100     NaN
l       Yash      99     1    True

**27. Write a Pandas program to write a DataFrame to CSV file using tab separator.**

In [144]:
df.to_csv('Qualification1.csv',index=False) #without a tab separator

df3 = pd.read_csv('Qualification1.csv')

print(df3)


#df.to_csv('Qualification.csv', sep='\t', index=False)
#df2 = pd.read_csv('Qualification.csv')
#print(df2)

         Name     Sex  Score Qualify
0   Anastasia  Female   12.5     NaN
1        Kyra  Female    9.0     NaN
2   Katherine  Female   16.5     NaN
3       James    Male    NaN     NaN
4       Emily  Female    9.0     NaN
5     Michael    Male   20.0     NaN
6     Matthew    Male   14.5     NaN
7       Laura  Female    NaN     NaN
8       Kevin    Male    8.0     NaN
9       Jonas    Male   19.0     NaN
10      Rohan    Male  100.0     NaN
11       Yash      99    1.0    True

In [151]:
df3.iloc[[0]]

        Name     Sex  Score Qualify
0  Anastasia  Female   12.5     NaN

**28. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).**

In [152]:
import pandas as pd
df4 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
g1 = df4.groupby(["city"]).size().reset_index(name='Number of people')
print(g1)

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [153]:
df4

        name         city
0  Anastasia   California
1       Dima  Los Angeles
2  Katherine   California
3      James   California
4      Emily   California
5    Michael  Los Angeles
6    Matthew  Los Angeles
7      Laura      Georgia
8      Kevin      Georgia
9      Jonas  Los Angeles

**29. Write a Pandas program to delete DataFrame row(s) based on given column value.**

In [154]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
df = df[df.col2 != 5]
print("New DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
New DataFrame
   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

**30. Write a Pandas program to widen output display to see more columns.**

In [156]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 5000)
print("Original DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

**31. Write a Pandas program to select a row of series/dataframe by given integer index.**

In [159]:
df.iloc[['3']]

   col1  col2  col3
3     4     7     0

**32. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.**

In [178]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original Dataframe")
print(df)
df = df.fillna(0)
print("Revised Dataframe")
print(df)

Original Dataframe
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes
Revised Dataframe
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

**33. Write a Pandas program to convert index in a column of the given dataframe.**

In [179]:
df.reset_index(level=0, inplace=True)
print(df.to_string(index=False))

 index       name  score  attempts qualify
     0  Anastasia   12.5         1     yes
     1       Dima    9.0         3      no
     2  Katherine   16.5         2     yes
     3      James    0.0         3      no
     4      Emily    9.0         2      no
     5    Michael   20.0         3     yes
     6    Matthew   14.5         1     yes
     7      Laura    0.0         1      no
     8      Kevin    8.0         2      no
     9      Jonas   19.0         1     yes

**35. Write a Pandas program to count the NaN values in one or more columns in DataFrame.**

In [221]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame")
print(df)
print("\nNumber of NaN values in one or more columns:")
print(df.isnull().values.sum())

Original DataFrame
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Number of NaN values in one or more columns:
2

In [215]:
df['score'].isnull().sum()

2

**36. Write a Pandas program to drop a list of rows from a specified DataFrame.**

In [222]:
df = df.drop(df.index[[1,8]])
print(df)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
9      Jonas   19.0         1     yes

**37. Write a Pandas program to reset index in a given DataFrame.**

In [223]:
df = df.reset_index()
print(df.to_string(index=False))

 index       name  score  attempts qualify
     0  Anastasia   12.5         1     yes
     2  Katherine   16.5         2     yes
     3      James    NaN         3      no
     4      Emily    9.0         2      no
     5    Michael   20.0         3     yes
     6    Matthew   14.5         1     yes
     7      Laura    NaN         1      no
     9      Jonas   19.0         1     yes

In [224]:
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      2  Katherine   16.5         2     yes
2      3      James    NaN         3      no
3      4      Emily    9.0         2      no
4      5    Michael   20.0         3     yes
5      6    Matthew   14.5         1     yes
6      7      Laura    NaN         1      no
7      9      Jonas   19.0         1     yes

**39. Write a Pandas program to combining two series into a DataFrame.**

In [225]:
import pandas as pd
import numpy as np
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])
print("Data Series:")
print(s1)
print(s2)
df = pd.concat([s1, s2], axis=1)
print("New DataFrame combining two series:")
print(df)

Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
0       10
1       20
2      php
3    30.12
4       40
dtype: object
New DataFrame combining two series:
        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

**40. Write a Pandas program to shuffle a given DataFrame rows.**

In [226]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame:")
print(df)
df = df.sample(frac=1)
print("\nNew DataFrame:")
print(df)

Original DataFrame:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

New DataFrame:
        name  score  attempts qualify
4      Emily    9.0         2      no
0  Anastasia   12.5         1     yes
7      Laura    NaN         1      no
9      Jonas   19.0         1     yes
2  Katherine   16.5         2     yes
8      Kevin    8.0         2      no
5    Michael   20.0         3     yes
1       Dima    9.0         3      no
3      James    NaN         3      no
6    Matthew   14.5         1     yes

**41. Write a Pandas program to convert DataFrame column type from string to datetime.**

In [50]:
import pandas as pd
import numpy as np
data = {'3/11/2000', '3/12/2000', '3/13/2000'}
df = pd.DataFrame(data, columns = ['Dates'])
df

       Dates
0  3/11/2000
1  3/12/2000
2  3/13/2000

In [36]:
print(df['Dates'].dtype)

object

In [40]:
df['Date']=pd.to_datetime(df['Dates'],infer_datetime_format=True , utc=True)

In [41]:
df

       Dates                      Date
0  3/11/2000 2000-03-11 00:00:00+00:00
1  3/12/2000 2000-03-12 00:00:00+00:00
2  3/13/2000 2000-03-13 00:00:00+00:00

In [42]:
df = df.drop(['Dates'], axis = 1)

In [43]:
df

                       Date
0 2000-03-11 00:00:00+00:00
1 2000-03-12 00:00:00+00:00
2 2000-03-13 00:00:00+00:00

In [44]:
#converte datetime to only date and no time in it

df['date_only'] = df['Date'].dt.date

In [45]:
df

                       Date   date_only
0 2000-03-11 00:00:00+00:00  2000-03-11
1 2000-03-12 00:00:00+00:00  2000-03-12
2 2000-03-13 00:00:00+00:00  2000-03-13

In [46]:
df = df.drop(['Date'], axis = 1)

In [47]:
df

    date_only
0  2000-03-11
1  2000-03-12
2  2000-03-13

In [48]:
df = df.rename(columns={"date_only": "Date"})
df

         Date
0  2000-03-11
1  2000-03-12
2  2000-03-13

In [38]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame:")
print(df)

Original DataFrame:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [54]:
df.sample()

      name  score  attempts qualify
6  Matthew   14.5         1     yes

In [39]:
df = df.rename(columns={'name':'Name','score':'Score','attempts':'Attempts','qualify':'Qualify'})
df

        Name  Score  Attempts Qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

**45. Write a Pandas program to find the row for where the value of a given column is maximum.**

In [9]:
df['Score'].max()

20.0

In [10]:
df['Score'].min()

8.0

**46. Write a Pandas program to check whether a given column is present in a DataFrame or not.**

In [11]:
if 'Score' in df.columns:
    print("Score present in Dataframe.")
else:
    print("Score not present in Dataframe.")

Score present in Dataframe.

**47. Write a Pandas program to get the specified row value of a given DataFrame.**

In [13]:
df.iloc[2]

Name        Katherine
Score            16.5
Attempts            2
Qualify           yes
Name: 2, dtype: object

**48. Write a Pandas program to get the datatypes of columns of a DataFrame.**

In [16]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Name        10 non-null object
Score       8 non-null float64
Attempts    10 non-null int64
Qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes
None

In [17]:
print(df.dtypes)

Name         object
Score       float64
Attempts      int64
Qualify      object
dtype: object

**49. Write a Pandas program to append data to an empty DataFrame.**

In [19]:
df.tail(1)

    Name  Score  Attempts Qualify
9  Jonas   19.0         1     yes

In [40]:
df.loc[10] = ['Rohan','100','1','yes']

In [41]:
df

         Name Score Attempts Qualify
0   Anastasia  12.5        1     yes
1        Dima     9        3      no
2   Katherine  16.5        2     yes
3       James   NaN        3      no
4       Emily     9        2      no
5     Michael    20        3     yes
6     Matthew  14.5        1     yes
7       Laura   NaN        1      no
8       Kevin     8        2      no
9       Jonas    19        1     yes
10      Rohan   100        1     yes

**50. Write a Pandas program to sort a given DataFrame by two or more columns**

In [42]:
df.sort_values(by=['Score','Attempts'],ascending=[True,True])

         Name Score Attempts Qualify
8       Kevin     8        2      no
4       Emily     9        2      no
1        Dima     9        3      no
0   Anastasia  12.5        1     yes
6     Matthew  14.5        1     yes
2   Katherine  16.5        2     yes
9       Jonas    19        1     yes
5     Michael    20        3     yes
10      Rohan   100        1     yes
7       Laura   NaN        1      no
3       James   NaN        3      no

**51. Write a Pandas program to convert the datatype of a given column (floats to ints).**

In [33]:
df.dtypes

Name        object
Score       object
Attempts    object
Qualify     object
dtype: object

In [43]:
df.Score = df.Score.astype(float)

In [45]:
df.Attempts = df.Attempts.astype(int)

In [46]:
df.dtypes

Name         object
Score       float64
Attempts      int32
Qualify      object
dtype: object

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11 entries, 0 to 10
Data columns (total 4 columns):
Name        11 non-null object
Score       9 non-null float64
Attempts    11 non-null int32
Qualify     11 non-null object
dtypes: float64(1), int32(1), object(2)
memory usage: 396.0+ bytes

**Write a Pandas program to remove infinite values from a given DataFrame.**

In [48]:
import pandas as pd
import numpy as np
df_inf = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print("Original DataFrame:")
print(df_inf)
print("Removing infinite values:")
df_inf = df_inf.replace([np.inf, -np.inf], np.nan)
print(df_inf)

Original DataFrame:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf
Removing infinite values:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

**53.  Write a Pandas program to insert a given column at a specific column index in a DataFrame.**

In [50]:
import pandas as pd
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df5 = pd.DataFrame(data=d)
print("Original DataFrame")
print(df5)
new_col = [1, 2, 3, 4, 7]  
# insert the said column at the beginning in the DataFrame
idx = 0
df5.insert(loc=idx, column='col1', value=new_col)
print("\nNew DataFrame")
print(df5)

Original DataFrame
   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

New DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

**54. Write a Pandas program to convert a given list of lists into a Dataframe.**

In [51]:
a = [[1,2,3,4],[5,6,7,8],[9,10,11,12]]

df_list = pd.DataFrame(data=a)
df_list

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

**55. Write a Pandas program to group by the first column and get second column as lists in rows.**

In [53]:
import pandas as pd
df_1 = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
print("Original DataFrame")
print(df_1)
df_1 = df_1.groupby('col1')['col2'].apply(list)
print("\nGroup on the col1:")
print(df_1)

Original DataFrame
  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

Group on the col1:
col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

**56. Write a Pandas program to get column index from column name of a given DataFrame.**

In [55]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\nIndex of 'col3'")
print(df.columns.get_loc("col3"))

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Index of 'col3'
2

**57. Write a Pandas program to count number of columns of a DataFrame.**

In [56]:
print(len(df.columns))

3

**58. Write a Pandas program to select all columns, except one given column in a DataFrame.**

In [59]:
df = df.loc[:, df.columns != 'col3']
df

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

**62. Write a Pandas program to remove first n rows of a given DataFrame.**

In [60]:
print("\nAfter removing first 3 rows of the said DataFrame:")
df1 = df.iloc[3:]
print(df1)

After removing first 3 rows of the said DataFrame:
   col1  col2
3     4     9
4     7     5

**63. Write a Pandas program to remove last n rows of a given DataFrame.**

In [65]:
print("\nAfter removing last 2 rows of the said DataFrame:")
df2 = df.iloc[:2]
print(df2)

After removing last 2 rows of the said DataFrame:
   col1  col2
0     1     4
1     2     5

**64. Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.**

In [66]:
import pandas as pd
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)
print("\nAdd prefix:")
print(df.add_prefix("A_"))
print("\nAdd suffix:")
print(df.add_suffix("_1"))

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

Add prefix:
   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

Add suffix:
   W_1  X_1  Y_1  Z_1
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

**65. Write a Pandas program to reverse order (rows, columns) of a given DataFrame.**

In [68]:
import pandas as pd
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)
print("\nReverse column order:")
print(df.loc[:, ::-1])

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

Reverse column order:
    Z   Y   X   W
0  86  84  78  68
1  97  94  85  75
2  96  89  96  86
3  72  83  80  80
4  83  86  86  66

In [69]:
print("\nReverse row order:")
print(df.loc[::-1])

Reverse row order:
    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86

In [70]:
print("\nReverse row order and reset index:")
print(df.loc[::-1].reset_index(drop = True))

Reverse row order and reset index:
    W   X   Y   Z
0  66  86  86  83
1  80  80  83  72
2  86  96  89  96
3  75  85  94  97
4  68  78  84  86

**66. Write a Pandas program to select columns by data type of a given DataFrame.**

In [75]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})

print("Original DataFrame")
print(df)
print("\nSelect numerical columns")
print(df.select_dtypes(include = "number"))

Original DataFrame
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

Select numerical columns
    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0

In [76]:
print("\nSelect string columns")
print(df.select_dtypes(include = "object"))

Select string columns
             name date_of_birth
0  Alberto Franco    17/05/2002
1    Gino Mcneill    16/02/1999
2     Ryan Parkes    25/09/1998
3    Eesha Hinton    11/05/2002
4    Syed Wharton    15/09/1997

In [77]:
print("\nSelect string columns")
print(df.select_dtypes(include = "float"))

Select string columns
    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0

**67. Write a Pandas program to split a given DataFrame into two random subsets.**

In [81]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': ['18', '21', '22', '22', '23']
})

df_1 = df.sample(frac = 0.4)
df_2 = df.drop(df_1.index)
print("Original Dataframe and shape:")
print(df)
print(df.shape)
print("\nSubset-1 and shape:")
print(df_1)
print(df_1.shape)
print("\nSubset-2 and shape:")
print(df_2)
print(df_2.shape)

Original Dataframe and shape:
             name date_of_birth age
0  Alberto Franco    17/05/2002  18
1    Gino Mcneill    16/02/1999  21
2     Ryan Parkes    25/09/1998  22
3    Eesha Hinton    11/05/2002  22
4    Syed Wharton    15/09/1997  23
(5, 3)

Subset-1 and shape:
             name date_of_birth age
2     Ryan Parkes    25/09/1998  22
0  Alberto Franco    17/05/2002  18
(2, 3)

Subset-2 and shape:
           name date_of_birth age
1  Gino Mcneill    16/02/1999  21
3  Eesha Hinton    11/05/2002  22
4  Syed Wharton    15/09/1997  23
(3, 3)

**68. Write a Pandas program to rename all columns with the same pattern of a given DataFrame.**

In [82]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})

print("Original DataFrame")
print(df)
df.columns = df.columns.str.lower().str.rstrip()
print("\nRemove trailing (at the end) whitesapce and convert to lowercase of the columns name")
print(df.head())

Original DataFrame
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

Remove trailing (at the end) whitesapce and convert to lowercase of the columns name
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

**Pandas program to remove trailing whitespaces in column names.**

In [84]:
df.columns = df.columns.str.lower().str.rstrip()
df

             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

**Pandas program to convert column names to initial caps.**

In [91]:
df.columns = df.columns.str.capitalize()
df

             Name Date_of_birth   Age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

**Pandas program to convert column names to all caps.**

In [90]:
df.columns = df.columns.str.upper()
df

             NAME DATE_OF_BIRTH   AGE
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

**69. Write a Pandas program to merge datasets and check uniqueness.**

In [97]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df1 = df.copy(deep = True)
df = df.drop([0, 1])
df1 = df1.drop([2])
print("\nNew DataFrames:")
print(df)
print(df1)
print('\n"one_to_one”: check if merge keys are unique in both left and right datasets:"')
df_one_to_one = pd.merge(df, df1, validate = "one_to_one")
print(df_one_to_one)
print('\n"one_to_many” or “1:m”: check if merge keys are unique in left dataset:')
df_one_to_many = pd.merge(df, df1, validate = "one_to_many")
print(df_one_to_many)
print('“many_to_one” or “m:1”: check if merge keys are unique in right dataset:')
df_many_to_one = pd.merge(df, df1, validate = "many_to_one")
print(df_many_to_one)

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

New DataFrames:
           Name Date_Of_Birth    Age
2   Ryan Parkes     25/09/1998  22.5
3  Eesha Hinton     11/05/2002  22.0
4  Syed Wharton     15/09/1997  23.0
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

"one_to_one”: check if merge keys are unique in both left and right datasets:"
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

"one_to_many” or “1:m”: check if merge keys are unique in left dataset:
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0
“many_to_one” or “m:1”: check if merge keys are unique in right dataset:
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

**70. Write a Pandas program to convert continuous values of a column in a given DataFrame to categorical.**

In [98]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]
})
print("Original DataFrame:")
print(df)
print('\nAge group:')
df["age_groups"] = pd.cut(df["age"], bins = [0, 18, 65, 99], labels = ["kids", "adult", "elderly"])
print(df["age_groups"])

Original DataFrame:
             name  age
0  Alberto Franco   18
1    Gino Mcneill   22
2     Ryan Parkes   85
3    Eesha Hinton   50
4    Syed Wharton   80
5   Kierra Gentry    5

Age group:
0       kids
1      adult
2    elderly
3      adult
4    elderly
5       kids
Name: age_groups, dtype: category
Categories (3, object): [kids < adult < elderly]

**Write a Pandas program to display memory usage of a given DataFrame and every column of the DataFrame.**

In [100]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
print("\nGlobal usage of memory of the DataFrame:")
print(df.info(memory_usage = "deep"))
print("\nThe usage of memory of every column of the said DataFrame:")
print(df.memory_usage(deep = True))

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

Global usage of memory of the DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Name              5 non-null object
Date_Of_Birth     5 non-null object
Age               5 non-null float64
dtypes: float64(1), object(2)
memory usage: 849.0 bytes
None

The usage of memory of every column of the said DataFrame:
Index             128
Name              346
Date_Of_Birth     335
Age                40
dtype: int64

**72. Write a Pandas program to combine many given series to create a DataFrame.**

In [101]:
import pandas as pd
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])
print("Original Series:")
print(sr1)
print(sr2)
print("Combine above series to a dataframe:")
ser_df = pd.DataFrame(sr1, sr2).reset_index()
print(ser_df.head())

Original Series:
0       php
1    python
2      java
3        c#
4       c++
dtype: object
0    1
1    2
2    3
3    4
4    5
dtype: int64
Combine above series to a dataframe:
   index       0
0      1  python
1      2    java
2      3      c#
3      4     c++
4      5     NaN

In [102]:
print("\nUsing pandas concat:")
ser_df = pd.concat([sr1, sr2], axis = 1)
print(ser_df.head())

Using pandas concat:
        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5

In [103]:
print("\nUsing pandas DataFrame with a dictionary, gives a specific name to the columns:")
ser_df = pd.DataFrame({"col1":sr1, "col2":sr2})
print(ser_df.head(5))

Using pandas DataFrame with a dictionary, gives a specific name to the columns:
     col1  col2
0     php     1
1  python     2
2    java     3
3      c#     4
4     c++     5

**73. Write a Pandas program to create DataFrames that contains random values, contains missing values, contains datetime values and contains mixed values.**

In [104]:
import pandas as pd
print("DataFrame: Contains random values:")
df1 = pd.util.testing.makeDataFrame() # contains random values
print(df1)
print("\nDataFrame: Contains missing values:")
df2 = pd.util.testing.makeMissingDataframe() # contains missing values
print(df2)
print("\nDataFrame: Contains datetime values:")
df3 = pd.util.testing.makeTimeDataFrame() # contains datetime values
print(df3)
print("\nDataFrame: Contains mixed values:")
df4 = pd.util.testing.makeMixedDataFrame() # contains mixed values
print(df4)

DataFrame: Contains random values:
                   A         B         C         D
MGIEpMpfk7  1.640682  2.521768 -0.287271  0.005861
5UzVUg2IG9 -0.676255 -0.489565  0.373931 -0.032392
P55i9lCnuw -0.072393  0.009049  1.436182  1.110365
uZcAOfG5Z9  0.067138  0.201913 -0.970897  0.060638
gs4liP5PqS  1.123598 -0.783507  0.989409 -0.031157
7sJo9XfkBM -0.521778  1.131069  1.330212  0.097264
1B0jMRr46s -0.002435  0.015795 -1.239974  0.866214
weWOfGrxgn  0.769077  0.934123  0.230432  0.304106
MiwtEmYgRn -2.163881 -2.284307  0.247209  0.151463
q93yLBmogn  0.933723 -0.266500 -0.468939 -1.375855
J9IzkQ8vBx  0.610471 -0.350159 -0.312256 -0.560725
RhrKztuzvu  0.094626  0.415807 -0.059415  0.065420
Pv8WWtxH6m -0.328255  0.148182  1.093574 -1.644789
xIoRDt6wCJ  0.714289 -1.223850  0.295104 -0.405370
F7fCndNhqR -1.336966  0.044815  0.319990  0.306467
IU6TDwFKsf -1.067751 -0.429726  0.547639 -0.142038
G3CplwF9BX -1.070386 -0.635197  0.109966  1.130135
SdiLipEAPj  0.200908 -1.891803  1.081847  1.457602
gFwnVKIO85 -0.301902 -1.248967 -0.522496 -1.721162
EdfEFRrJ5K  0.248665  0.933566  0.373760  0.832146
2yEEKE9XZe  0.307507 -1.108752 -0.821015  0.739098
fIzZHtkt5Q  0.530754  1.486883  0.195772 -0.090172
1IRwIze8oI -0.373430  3.184514 -0.212654  0.625366
U41twPf280 -0.493178 -0.328927  1.489140 -1.642177
N4CQgmp2vG -0.533099 -0.279929  0.483050  1.248152
q5MTvhyPf9 -0.615485 -1.500728  1.750230  0.302319
pInwcciOUq -0.320909  0.084641 -0.414711  0.751608
SdijKiLMVd -1.903953  0.934335 -0.685312 -0.844545
LxQyWQGdtM -0.634656  2.344374  0.188519  0.571291
Df9jEOI7I4 -3.244206 -0.298808  0.788962 -0.374802

DataFrame: Contains missing values:
                   A         B         C         D
BRx46Sijhf       NaN  1.311004 -0.599842       NaN
tCVa8apZas  2.657921 -1.052414  0.027760       NaN
U87g1w68XS -0.567754  0.889698 -1.533788 -0.571061
VlxWRZH096 -1.479764  0.551688  1.700758 -0.458271
2HPLkvJOFx       NaN -0.213995  0.302236 -0.212241
5p24SyShnj -0.692016 -0.134609       NaN  0.149047
W5Ub6RvA0E -1.114239  1.571794 -1.023312  1.735696
5WTcet7KYE  0.304569 -2.259798  0.674435  0.955192
dwanorE4lp -1.224817 -0.021790 -1.624462 -0.964869
RbKelHiSkB       NaN -0.566007 -1.815138  0.191155
7WugsBWRWl -1.012439       NaN  0.890970  0.845041
khcVUlFa7T -0.035424 -0.372284 -1.345074  0.276474
aTBNUIKFh5  0.255824  0.522379  2.086818  0.011461
vAcVRDLH7d -0.456035  1.169459 -0.313376 -0.145874
XZ3jyvYh9f -1.047862 -0.271841  0.544761 -0.365220
CMI29YbMvm       NaN  0.518065  0.293258 -0.549000
HPQnHAGa0a -0.240098 -0.681490 -3.219583  0.579040
oByDGTwNsp  0.310961  1.221626 -0.393520  0.769208
Q85gtSItna -0.672592 -0.477221  1.026891 -2.791779
8axhfzMpqd  0.478438 -1.157283 -1.936357  0.804972
rPlGPsrvkL       NaN -0.721484 -1.648876  1.399347
PGpIGtXyFp -0.291002       NaN  0.866085  0.787689
ON0FfHLCYv -1.266262  0.744242  1.334612  1.192721
YGgvN6vKkj -0.587220 -1.034438 -0.838723 -0.027122
gO8Fus4Vs0       NaN       NaN -0.635556  0.797482
NWZFHNLXEn  0.332718 -0.818482 -2.995525 -0.589687
Tsmh84Hb06 -0.406242  0.909961 -0.721740  2.715887
zQyVaBad08  1.748005 -0.092390 -0.890420  0.051715
14AI9v8pjo -0.337663  0.535934  1.101012  0.885166
naIjubvDrz  2.062973  0.343280 -1.256630  0.428987

DataFrame: Contains datetime values:
                   A         B         C         D
2000-01-03  0.420145 -0.956388 -1.378858  1.592343
2000-01-04  0.370693  0.318192  0.496677 -0.372279
2000-01-05 -0.763883  1.660019  0.312942 -0.492197
2000-01-06  0.091045  0.857581 -1.908903  0.628899
2000-01-07 -0.083281 -0.783667  0.940651  0.604303
2000-01-10 -0.207962 -0.742829  2.513542  0.736522
2000-01-11 -1.640476 -1.124808 -0.568909  0.693844
2000-01-12  0.466894 -1.480287 -0.674354 -0.557265
2000-01-13 -1.254323  1.361530  0.711543 -2.254710
2000-01-14 -1.087850  2.588941  1.432039 -0.157546
2000-01-17 -0.024584  0.649108 -1.625935 -1.172684
2000-01-18 -1.840409  0.225133 -1.114705 -0.100762
2000-01-19 -1.061247  0.242989 -0.052731  0.001326
2000-01-20 -0.165636  0.200214  0.222301  0.701023
2000-01-21 -1.640293 -0.398468 -0.358733  0.663390
2000-01-24 -2.050687  1.316310 -0.709926 -0.810000
2000-01-25  1.151028 -0.631009 -0.696323 -0.436731
2000-01-26 -2.206282  0.463627 -0.938647  1.712577
2000-01-27  0.758564  0.120246  1.630457 -0.983084
2000-01-28 -0.171593  0.642445  0.622960  1.169301
2000-01-31 -0.363160  1.759260  1.943297 -0.523671
2000-02-01 -0.621997  0.364985  0.360906 -1.698589
2000-02-02  0.126569  0.788702 -1.982002  1.172863
2000-02-03 -0.677761  0.990472  0.123937  0.482055
2000-02-04 -0.468928 -1.638345  0.356582 -1.822596
2000-02-07  1.582921 -2.143344 -0.893946  1.561743
2000-02-08 -0.241522  0.466127  1.064449 -0.821842
2000-02-09 -0.666290  0.689308  0.088924  0.458221
2000-02-10  0.747067 -0.366696 -0.556369 -0.302646
2000-02-11  0.730354 -1.598966  0.395224  0.175384

DataFrame: Contains mixed values:
     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

**74. Write a Pandas program to fill missing values in time series data.**

In [105]:
import pandas as pd
import numpy as np
sdata = {"c1":[120, 130 ,140, 150, np.nan, 170], "c2":[7, np.nan, 10, np.nan, 5.5, 16.5]}
df = pd.DataFrame(sdata)
df.index = pd.util.testing.makeDateIndex()[0:6]
print("Original DataFrame:")
print(df)

Original DataFrame:
               c1    c2
2000-01-03  120.0   7.0
2000-01-04  130.0   NaN
2000-01-05  140.0  10.0
2000-01-06  150.0   NaN
2000-01-07    NaN   5.5
2000-01-10  170.0  16.5

In [106]:
print("\nDataFrame after interpolate:")
print(df.interpolate())

DataFrame after interpolate:
               c1     c2
2000-01-03  120.0   7.00
2000-01-04  130.0   8.50
2000-01-05  140.0  10.00
2000-01-06  150.0   7.75
2000-01-07  160.0   5.50
2000-01-10  170.0  16.50

**75. Write a Pandas program to use a local variable within a query.**

In [107]:
import pandas as pd
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)
maxx = df["W"].max()
print("\nValues which are less than maximum value of 'W' column")
print(df.query("W < @maxx"))

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

Values which are less than maximum value of 'W' column
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
3  80  80  83  72
4  66  86  86  83

**76. Write a Pandas program to clean object column with mixed data of a given DataFrame using regular expression.**

In [109]:
import pandas as pd
d = {"agent": ["a001", "a002", "a003", "a003", "a004"], "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]}
df = pd.DataFrame(d)
print("Original dataframe:")
print(df)
print("\nData Types:")
print(df["purchase"].apply(type))
df["purchase"] = df["purchase"].replace("[$,]", "", regex = True).astype("float")
print("\nNew Data Types:")
print(df["purchase"].apply(type)) 
df

Original dataframe:
  agent  purchase
0  a001      4500
1  a002      7500
2  a003  $3000.25
3  a003  $1250.35
4  a004   9000.00

Data Types:
0    <class 'float'>
1    <class 'float'>
2      <class 'str'>
3      <class 'str'>
4      <class 'str'>
Name: purchase, dtype: object

New Data Types:
0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
4    <class 'float'>
Name: purchase, dtype: object

  agent  purchase
0  a001   4500.00
1  a002   7500.00
2  a003   3000.25
3  a003   1250.35
4  a004   9000.00

**77. Write a Pandas program to get the numeric representation of an array by identifying distinct values of a given column of a dataframe**

In [113]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
label1, unique1 = pd.factorize(df['Name'])
print("\nNumeric representation of an array by identifying distinct values:")
print("label1:",label1)
print()
print("unique1:",unique1)

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Gino Mcneill     15/09/1997  23.0

Numeric representation of an array by identifying distinct values:
label1: [0 1 2 3 1]

unique1: Index(['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton'], dtype='object')

**78. Write a Pandas program to convert year and day of year into a single datetime column of a dataframe.**